/*
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 */

#ifndef _ox820_hw_gmac_h
#define _ox820_hw_gmac_h

#include <linux/types.h>

/* DMA descriptor block */
struct ox820_gmac_dma_desc_t {
    /** The encoded status field of the GMAC descriptor */
    u32 status;
    /** The encoded length field of GMAC descriptor */
    u32 length;
    /** Buffer 1 pointer field of GMAC descriptor */
    u32 buffer1;
    /** Buffer 2 pointer or next descriptor pointer field of GMAC descriptor */
    u32 buffer2;
};

/* status (rx_desc) */
#define MSK_OX820_GMAC_DMA_RX_STATUS_OWN	0x80000000
#define BIT_OX820_GMAC_DMA_RX_STATUS_OWN	31
#define MSK_OX820_GMAC_DMA_RX_STATUS_AFM	0x40000000
#define BIT_OX820_GMAC_DMA_RX_STATUS_AFM	30
#define MSK_OX820_GMAC_DMA_RX_STATUS_FL		0x3FFF0000
#define BIT_OX820_GMAC_DMA_RX_STATUS_FL		16
#define MSK_OX820_GMAC_DMA_RX_STATUS_ES		0x00008000
#define BIT_OX820_GMAC_DMA_RX_STATUS_ES		15
#define MSK_OX820_GMAC_DMA_RX_STATUS_DE		0x00004000
#define BIT_OX820_GMAC_DMA_RX_STATUS_DE		14
#define MSK_OX820_GMAC_DMA_RX_STATUS_SAF	0x00002000
#define BIT_OX820_GMAC_DMA_RX_STATUS_SAF	13
#define MSK_OX820_GMAC_DMA_RX_STATUS_LE		0x00001000
#define BIT_OX820_GMAC_DMA_RX_STATUS_LE		12
#define MSK_OX820_GMAC_DMA_RX_STATUS_OE		0x00000800
#define BIT_OX820_GMAC_DMA_RX_STATUS_OE		11
#define MSK_OX820_GMAC_DMA_RX_STATUS_VLAN	0x00000400
#define BIT_OX820_GMAC_DMA_RX_STATUS_VLAN	10
#define MSK_OX820_GMAC_DMA_RX_STATUS_FS		0x00000200
#define BIT_OX820_GMAC_DMA_RX_STATUS_FS		9
#define MSK_OX820_GMAC_DMA_RX_STATUS_LS		0x00000100
#define BIT_OX820_GMAC_DMA_RX_STATUS_LS		8
#define MSK_OX820_GMAC_DMA_RX_STATUS_IPC	0x00000080
#define BIT_OX820_GMAC_DMA_RX_STATUS_IPC	7
#define MSK_OX820_GMAC_DMA_RX_STATUS_LC		0x00000040
#define BIT_OX820_GMAC_DMA_RX_STATUS_LC		6
#define MSK_OX820_GMAC_DMA_RX_STATUS_FT		0x00000020
#define BIT_OX820_GMAC_DMA_RX_STATUS_FT		5
#define MSK_OX820_GMAC_DMA_RX_STATUS_RWT	0x00000010
#define BIT_OX820_GMAC_DMA_RX_STATUS_RWT	4
#define MSK_OX820_GMAC_DMA_RX_STATUS_RE		0x00000008
#define BIT_OX820_GMAC_DMA_RX_STATUS_RE		3
#define MSK_OX820_GMAC_DMA_RX_STATUS_DRE	0x00000004
#define BIT_OX820_GMAC_DMA_RX_STATUS_DRE	2
#define MSK_OX820_GMAC_DMA_RX_STATUS_CE		0x00000002
#define BIT_OX820_GMAC_DMA_RX_STATUS_CE		1
#define MSK_OX820_GMAC_DMA_RX_STATUS_PCE	0x00000001
#define BIT_OX820_GMAC_DMA_RX_STATUS_PCE	0

/* status (tx_desc0) */
#define MSK_OX820_GMAC_DMA_TX_STATUS_OWN	0x80000000
#define BIT_OX820_GMAC_DMA_TX_STATUS_OWN	31
#define MSK_OX820_GMAC_DMA_TX_STATUS_IC		0x40000000
#define BIT_OX820_GMAC_DMA_TX_STATUS_IC		30
#define MSK_OX820_GMAC_DMA_TX_STATUS_LS		0x20000000
#define BIT_OX820_GMAC_DMA_TX_STATUS_LS		29
#define MSK_OX820_GMAC_DMA_TX_STATUS_FS		0x10000000
#define BIT_OX820_GMAC_DMA_TX_STATUS_FS		28
#define MSK_OX820_GMAC_DMA_TX_STATUS_DC		0x08000000
#define BIT_OX820_GMAC_DMA_TX_STATUS_DC		27
#define MSK_OX820_GMAC_DMA_TX_STATUS_DP		0x08000000
#define BIT_OX820_GMAC_DMA_TX_STATUS_DP		27
#define MSK_OX820_GMAC_DMA_TX_STATUS_CIC	0x00C00000
#define BIT_OX820_GMAC_DMA_TX_STATUS_CIC	22
#define VAL_OX820_GMAC_DMA_TX_STATUS_CIC_NONE	0x00000000
#define VAL_OX820_GMAC_DMA_TX_STATUS_CIC_HDR	0x00400000
#define VAL_OX820_GMAC_DMA_TX_STATUS_CIC_PAYLD	0x00800000
#define VAL_OX820_GMAC_DMA_TX_STATUS_CIC_FULL	0x00C00000
#define MSK_OX820_GMAC_DMA_TX_STATUS_TER	0x00200000
#define BIT_OX820_GMAC_DMA_TX_STATUS_TER	21
#define MSK_OX820_GMAC_DMA_TX_STATUS_TCH	0x00100000
#define BIT_OX820_GMAC_DMA_TX_STATUS_TCH	20
#define MSK_OX820_GMAC_DMA_TX_STATUS_IHE	0x00010000
#define BIT_OX820_GMAC_DMA_TX_STATUS_IHE	16
#define MSK_OX820_GMAC_DMA_TX_STATUS_ES		0x00008000
#define BIT_OX820_GMAC_DMA_TX_STATUS_ES		15
#define MSK_OX820_GMAC_DMA_TX_STATUS_JT		0x00004000
#define BIT_OX820_GMAC_DMA_TX_STATUS_JT		14
#define MSK_OX820_GMAC_DMA_TX_STATUS_FF		0x00002000
#define BIT_OX820_GMAC_DMA_TX_STATUS_FF		13
#define MSK_OX820_GMAC_DMA_TX_STATUS_IPE	0x00001000
#define BIT_OX820_GMAC_DMA_TX_STATUS_IPE	12
#define MSK_OX820_GMAC_DMA_TX_STATUS_LOC	0x00000800
#define BIT_OX820_GMAC_DMA_TX_STATUS_LOC	11
#define MSK_OX820_GMAC_DMA_TX_STATUS_NC		0x00000400
#define BIT_OX820_GMAC_DMA_TX_STATUS_NC		10
#define MSK_OX820_GMAC_DMA_TX_STATUS_LC		0x00000200
#define BIT_OX820_GMAC_DMA_TX_STATUS_LC		9
#define MSK_OX820_GMAC_DMA_TX_STATUS_EC		0x00000100
#define BIT_OX820_GMAC_DMA_TX_STATUS_EC		8
#define MSK_OX820_GMAC_DMA_TX_STATUS_VF		0x00000080
#define BIT_OX820_GMAC_DMA_TX_STATUS_VF		7
#define MSK_OX820_GMAC_DMA_TX_STATUS_CC		0x00000078
#define BIT_OX820_GMAC_DMA_TX_STATUS_CC		3
#define MSK_OX820_GMAC_DMA_TX_STATUS_ED		0x00000004
#define BIT_OX820_GMAC_DMA_TX_STATUS_ED		2
#define MSK_OX820_GMAC_DMA_TX_STATUS_UF		0x00000002
#define BIT_OX820_GMAC_DMA_TX_STATUS_UF		1
#define MSK_OX820_GMAC_DMA_TX_STATUS_DB		0x00000001
#define BIT_OX820_GMAC_DMA_TX_STATUS_DB		0

/* length (tx_desc1) */
#define MSK_OX820_GMAC_DMA_TX_LENGTH_TBS2	0x1FFF0000
#define BIT_OX820_GMAC_DMA_TX_LENGTH_TBS2	16
#define MSK_OX820_GMAC_DMA_TX_LENGTH_TBS1	0x00001FFF
#define BIT_OX820_GMAC_DMA_TX_LENGTH_TBS1	0


static inline int is_tx_valid(u32 status)
{
    return !(status & MSK_OX820_GMAC_DMA_TX_STATUS_ES);
}

static inline int is_tx_collision_error(u32 status)
{
    return (status & MSK_OX820_GMAC_DMA_TX_STATUS_CC) >> BIT_OX820_GMAC_DMA_TX_STATUS_CC;
}

static inline int is_tx_aborted(u32 status)
{
    return status & (MSK_OX820_GMAC_DMA_TX_STATUS_LC | MSK_OX820_GMAC_DMA_TX_STATUS_EC);
}

static inline int is_tx_carrier_error(u32 status)
{
    return status & (MSK_OX820_GMAC_DMA_TX_STATUS_LOC | MSK_OX820_GMAC_DMA_TX_STATUS_NC);
}


// Rx and Tx descriptors have the same max size for their associated buffers
#define OX820_GMAC_MAX_DESCRIPTOR_SHIFT		11
#define OX820_GMAC_MAX_DESCRIPTOR_LENGTH	((1 << OX820_GMAC_MAX_DESCRIPTOR_SHIFT) - 1)

// Round down to nearest quad length
#define OX820_GMAC_MAX_PACKET_FRAGMENT_LENGTH 	((OX820_GMAC_MAX_DESCRIPTOR_LENGTH >> 2) << 2)


/* registers */
struct ox820_gmac_macaddress_registers_t
{
	u32         high;
	u32         low;
};

struct ox820_gmac_registers_t
{
	u32         mac_config;                 /* +0x0000 */
	u32         mac_frame_filter;           /* +0x0004 */
	u32         hash_table_high;            /* +0x0008 */
	u32         hash_table_low;             /* +0x000C */
	u32         gmii_address;               /* +0x0010 */
	u32         gmii_data;                  /* +0x0014 */
	u32         flow_control;               /* +0x0018 */
	u32         vlan_tag;                   /* +0x001C */
	u32         version;                    /* +0x0020 */
	u32         debug;                      /* +0x0024 */
	u32         remote_wakeup;              /* +0x0028 */
	u32         pmt_control_status;         /* +0x002C */
	u32         reserved_0[2];              /* +0x0030 */
	u32         interrupt_status;           /* +0x0034 */
	u32         interrupt_mask;             /* +0x0038 */
	u32         reserved_1;                 /* +0x003C */
	struct ox820_gmac_macaddress_registers_t   mac_addr[16];   /* +0x0040 */
	u32         an_control;                 /* +0x00C0 */
	u32         an_status;                  /* +0x00C4 */
	u32         an_advert;                  /* +0x00C8 */
	u32         an_lpa;                     /* +0x00CC */
	u32         an_exp;                     /* +0x00D0 */
	u32         tbi_ext_status;             /* +0x00D4 */
	volatile u32 mii_status;                /* +0x00D8 keep the optimization from optimizing the reads we do */
	u32         reserved_2[9];              /* +0x00DC */
	u32	    mmc_control;		/* +0x0100 */
	u32	    mmc_rx_int;			/* +0x0104 */
	u32         mmc_tx_int;			/* +0x0108 */
	u32         mmc_rx_mask;		/* +0x010C */
	u32         mmc_tx_mask;		/* +0x0110 */
	u32         mmc_regs[123];              /* +0x0114 */
	u32         reserved_3[256];            /* +0x0300 */
	u32         ts_control;                 /* +0x0700 */
	u32         ts_subsec_inc;              /* +0x0704 */
	u32         ts_seconds;                 /* +0x0708 */
	u32         ts_nanosecs;                /* +0x070C */
	u32         ts_sec_update;              /* +0x0710 */
	u32         ts_nanosec_update;          /* +0x0714 */
	u32         ts_addend;                  /* +0x0718 */
	u32         ts_target_time_sec;         /* +0x071C */
	u32         ts_target_time_nanosec;     /* +0x0720 */
	u32         ts_higher_word_seconds;     /* +0x0724 */
	u32         ts_status;                  /* +0x0728 */
	u32         ts_pps_control;             /* +0x072C */
	u32         ts_aux_tstamp_nanosec;      /* +0x0730 */
	u32         ts_aux_tstamp_sec;          /* +0x0734 */
	u32         reserved_4[50];             /* +0x0738 */
	struct ox820_gmac_macaddress_registers_t   mac_addr2[16]; /* +0x0800 */
	u32         reserved_5[480];            /* +0x0880 */
	u32         dma_bus_mode;               /* +0x1000 */
	u32         dma_tx_poll_demand;         /* +0x1004 */
	u32         dma_rx_poll_demand;         /* +0x1008 */
	u32         dma_rx_descriptor_list;     /* +0x100C */
	u32         dma_tx_descriptor_list;     /* +0x1010 */
	volatile u32 dma_status;                /* +0x1014 keep the optimizer from optimizing away write back same value */
	u32         dma_opmode;                 /* +0x1018 */
	u32         dma_intenable;              /* +0x101C */
	u32         dma_miss_frame_bufovfl_cnt; /* +0x1020 */
	u32         dma_rx_int_wdog_timer;      /* +0x1024 */
	u32         reserved_6[8];              /* +0x1028 */
	u32         dma_cur_host_tx_desc;       /* +0x1048 */
	u32         dma_cur_host_rx_desc;       /* +0x104C */
	u32         dma_cur_host_tx_bufadr;     /* +0x1050 */
	u32         dma_cur_host_rx_bufadr;     /* +0x1054 */
	u32         hw_feature;                 /* +0x1058 */
};

/* mac_config */
#define MSK_OX820_GMAC_MAC_CONFIG_SFTERR                0x04000000
#define BIT_OX820_GMAC_MAC_CONFIG_SFTERR                26

#define MSK_OX820_GMAC_MAC_CONFIG_CST                   0x02000000
#define BIT_OX820_GMAC_MAC_CONFIG_CST                   25

#define MSK_OX820_GMAC_MAC_CONFIG_TC                    0x01000000
#define BIT_OX820_GMAC_MAC_CONFIG_TC                    24

#define MSK_OX820_GMAC_MAC_CONFIG_WD                    0x00800000
#define BIT_OX820_GMAC_MAC_CONFIG_WD                    23

#define MSK_OX820_GMAC_MAC_CONFIG_JD                    0x00400000
#define BIT_OX820_GMAC_MAC_CONFIG_JD                    22

#define MSK_OX820_GMAC_MAC_CONFIG_BE                    0x00200000
#define BIT_OX820_GMAC_MAC_CONFIG_BE                    21

#define MSK_OX820_GMAC_MAC_CONFIG_JE                    0x00100000
#define BIT_OX820_GMAC_MAC_CONFIG_JE                    20

